logs/small/dataplane-probe-activator.log
{"level":"info","ts":1692774004.9042995,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/08/23 07:00:05 Starting dataplane probe for target: activator
Requests      [total, rate, throughput]         180000, 1000.00, 999.43
Duration      [total, attack, wait]             3m0s, 3m0s, 102.062ms
Latencies     [min, mean, 50, 90, 95, 99, max]  101.086ms, 102.466ms, 102.086ms, 102.661ms, 102.852ms, 109.181ms, 458.841ms
Bytes In      [total, mean]                     4299819, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:180000  
Error Set:
2023/08/23 07:03:05 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
2023/08/23 07:03:05 Dataplane probe test finished
2023/08/23 07:03:05 Shutting down InfluxReporter