logs/small/rollout-probe-queue.log
{"level":"info","ts":1693208029.0730217,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/08/28 07:33:49 Running rollout probe test with selector: serving.knative.dev/service=queue-proxy-with-cc
2023/08/28 07:33:50 Inferred first revision = queue-proxy-with-cc-00001
2023/08/28 07:34:19 Updating the service: queue-proxy-with-cc
2023/08/28 07:34:19 Successfully updated the service.
Requests      [total, rate, throughput]         648002, 3600.03, 3501.67
Duration      [total, attack, wait]             3m0s, 3m0s, 103.8ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.511ms, 124.966ms, 103.957ms, 106.077ms, 112.76ms, 993.182ms, 7.342s
Bytes In      [total, mean]                     20042458, 30.93
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           97.32%
Status Codes  [code:count]                      200:630661  503:17341
Error Set:
503 Service Unavailable
2023/08/28 07:36:49 Shutting down InfluxReporter
2023/08/28 07:36:49 SLA 1 failed. P95 latency is not in 100-110ms time range: 112.760309ms
job.batch "rollout-probe-queue-direct" deleted
service.serving.knative.dev "queue-proxy-with-cc" deleted