logs/small/scale-from-zero-1.log
2023/08/23 07:52:34 Starting scale from zero test
2023/08/23 07:52:38 Created all the services in 4.045097519s
2023/08/23 07:52:38 00: waiting for deployment to scale to zero
2023/08/23 07:52:38 All pods are done (scaled to zero) or terminating after 5.29µs
2023/08/23 07:52:38 00: waiting for endpoint to serve request
2023/08/23 07:52:38 Spoofing perftest-scalefromzero-00-lxgtussa.default.svc.cluster.local -> perftest-scalefromzero-00-lxgtussa.default.svc.cluster.local
2023/08/23 07:52:38 Service is ready after: name: perftest-scalefromzero-00-lxgtussa, deployment-updated: 0ms, service-ready-since-deployment: 7ms, service-ready-total: 7ms
2023/08/23 07:52:38 Shutting down VegetaReporter
Requests      [total, rate, throughput]         1, 1.00, 0.00
Duration      [total, attack, wait]             7.345ms, 0s, 7.345ms
Latencies     [min, mean, 50, 90, 95, 99, max]  7.345ms, 7.345ms, 7.345ms, 7.345ms, 7.345ms, 7.345ms, 7.345ms
Bytes In      [total, mean]                     0, 0.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:1  
Error Set:
2023/08/23 07:52:38 SLA 1 passed. P95 latency is in 0-15000000ms time range
2023/08/23 07:52:38 SLA 2 passed. Max latency is below or equal to 15000000ms
2023/08/23 07:52:38 Scale from zero test completed
2023/08/23 07:52:39 Shutting down InfluxReporter