logs/small/scale-from-zero-5.log
2023/08/23 07:07:43 Starting scale from zero test
2023/08/23 07:07:49 Created all the services in 6.050459389s
2023/08/23 07:07:49 04: waiting for deployment to scale to zero
2023/08/23 07:07:49 All pods are done (scaled to zero) or terminating after 4.676µs
2023/08/23 07:07:49 01: waiting for deployment to scale to zero
2023/08/23 07:07:49 03: waiting for deployment to scale to zero
2023/08/23 07:07:49 All pods are done (scaled to zero) or terminating after 1.249µs
2023/08/23 07:07:49 00: waiting for deployment to scale to zero
2023/08/23 07:07:49 02: waiting for deployment to scale to zero
2023/08/23 07:07:49 All pods are done (scaled to zero) or terminating after 557ns
2023/08/23 07:07:49 All pods are done (scaled to zero) or terminating after 4.624µs
2023/08/23 07:07:49 All pods are done (scaled to zero) or terminating after 2.784µs
2023/08/23 07:07:49 03: waiting for endpoint to serve request
2023/08/23 07:07:49 Spoofing perftest-scalefromzero-03-fwbsepmk.default.svc.cluster.local -> perftest-scalefromzero-03-fwbsepmk.default.svc.cluster.local
2023/08/23 07:07:49 01: waiting for endpoint to serve request
2023/08/23 07:07:49 Spoofing perftest-scalefromzero-01-ezcxifty.default.svc.cluster.local -> perftest-scalefromzero-01-ezcxifty.default.svc.cluster.local
2023/08/23 07:07:49 00: waiting for endpoint to serve request
2023/08/23 07:07:49 Spoofing perftest-scalefromzero-00-sknfmior.default.svc.cluster.local -> perftest-scalefromzero-00-sknfmior.default.svc.cluster.local
2023/08/23 07:07:49 04: waiting for endpoint to serve request
2023/08/23 07:07:49 Spoofing perftest-scalefromzero-04-ccetgidy.default.svc.cluster.local -> perftest-scalefromzero-04-ccetgidy.default.svc.cluster.local
2023/08/23 07:07:49 02: waiting for endpoint to serve request
2023/08/23 07:07:49 Spoofing perftest-scalefromzero-02-gqarrlne.default.svc.cluster.local -> perftest-scalefromzero-02-gqarrlne.default.svc.cluster.local
2023/08/23 07:07:49 Service is ready after: name: perftest-scalefromzero-01-ezcxifty, deployment-updated: 0ms, service-ready-since-deployment: 10ms, service-ready-total: 10ms
2023/08/23 07:07:49 Service is ready after: name: perftest-scalefromzero-02-gqarrlne, deployment-updated: 0ms, service-ready-since-deployment: 8ms, service-ready-total: 8ms
2023/08/23 07:07:49 Service is ready after: name: perftest-scalefromzero-03-fwbsepmk, deployment-updated: 0ms, service-ready-since-deployment: 10ms, service-ready-total: 10ms
2023/08/23 07:07:49 Service is ready after: name: perftest-scalefromzero-04-ccetgidy, deployment-updated: 0ms, service-ready-since-deployment: 11ms, service-ready-total: 11ms
2023/08/23 07:07:49 Service is ready after: name: perftest-scalefromzero-00-sknfmior, deployment-updated: 0ms, service-ready-since-deployment: 12ms, service-ready-total: 12ms
2023/08/23 07:07:49 Shutting down VegetaReporter
Requests      [total, rate, throughput]         5, 5.00, 0.00
Duration      [total, attack, wait]             12.536ms, 0s, 12.536ms
Latencies     [min, mean, 50, 90, 95, 99, max]  8.618ms, 10.707ms, 10.624ms, 12.536ms, 12.536ms, 12.536ms, 12.536ms
Bytes In      [total, mean]                     0, 0.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:5  
Error Set:
2023/08/23 07:07:49 SLA 1 passed. P95 latency is in 0-15000000ms time range
2023/08/23 07:07:49 SLA 2 passed. Max latency is below or equal to 20000000ms
2023/08/23 07:07:49 Scale from zero test completed
2023/08/23 07:07:49 Shutting down InfluxReporter